In [2]:
import pandas as pd
import numpy as np

In [3]:
a = pd.DataFrame(np.arange(12).reshape(3,4))

In [4]:
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [5]:
#指定行列索引
#行索引，表明不同行，横向索引，叫index，0轴，axis=0
#列索引，表名不同列，纵向索引，叫columns，1轴，axis=1
b = pd.DataFrame(np.arange(12).reshape(3,4),index=list("abc"),columns=list("WXYZ"))

In [6]:
b

   W  X   Y   Z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [7]:
d1 = {"name":["ztfl","xyql","scsyl"],"age":[20,26,26],"tel":[10086,138830,139839]}

In [8]:
t1 = pd.DataFrame(d1)

In [9]:
t1

    name  age     tel
0   ztfl   20   10086
1   xyql   26  138830
2  scsyl   26  139839

In [10]:
d2 = [{"name":"ztfl","age":20,"tel":10086},{"name":"xyql","age":26},{"name":"scsyl","tel":139839}]

In [11]:
t2 = pd.DataFrame(d2)

In [12]:
t2

    age   name       tel
0  20.0   ztfl   10086.0
1  26.0   xyql       NaN
2   NaN  scsyl  139839.0